export const firstMessage = `Привіт! 👋  
Я OneStep — бот, який допомагає знайомитися та знаходити потрібних людей поруч із тобою 💬

📍 Як це працює:
1. Ти пишеш повідомлення або запит (наприклад: "є павербанк?", "йдемо на каву?", "хто з 4 гуртожитку?")
2. Я передаю його всім користувачам поблизу — від 500 метрів до 2 кілометрів! (вирішиш самостійно)
3. Якщо когось зацікавить — вони відгукнуться, і ви зможете поспілкуватись 🔥

💡 Я — зручна альтернатива зайвим групам.  
Не треба шукати чат по гуртожитку чи факультету — просто напиши тут, і твоє повідомлення побачать ті, хто поруч.

🔐 Анонімність гарантована. Твоє ім’я й локація нікому напряму не передаються.

🚀 Готовий зробити перший крок?
`;

export const MessageForCreateProfile = {
  is_not_geo: 'Я очікую геолокацію 📍',
  is_not_photo: 'Я очікую фото! 📸',
  location_saved: '✅ Геолокацію збережено!',
  send_photo: '📸 Надішли кілька своїх фото 😉',
  file_id_not_found: '❗ Не вдалося обробити фото. Спробуй ще раз.',
  saved_photo: '✅ Фото отримано! Анкету завершено 🎉',
  get_profile: '👀 Ось як вона виглядає:',
  profile_creating:
    '🚀 Ти готовий шукати нові знайомства! Не соромся — перший крок робить найсміливіший 😎',
  send_name: '✍️ Введи своє ім’я, тільки без пробілів і цифр 😉',
  saved_name: "🔒 Ім'я збережено!",
  send_age: '📆 А тепер скільки тобі років?  Не обманюй, 😉',
  saved_age: '✅ Вік збережено!',
  send_gender: '👥 Обери, хто ти: хлопець чи дівчина?',
  is_not_gender: '❗ Обери варіант натиснувши одну з кнопок:',
  saved_gender: '👌 Прийнято!',
  send_geo: '📍 Надішли свою геолокацію, щоби я міг знайти людей поруч 🧭',
};

export const MessageForSend = {
  cant_send:
    '🕔 Ти вже нещодавно надсилав повідомлення.\n\nБудь ласка, зачекай 5 хвилин ⏳',
  users_not_found:
    '📭 Поки що нікого поруч не знайшлось. Спробуй трохи пізніше або онови свою геолокацію 🌍',
  start_send_message:
    '👋 Готовий(а) до нових знайомств? А може, просто хочеш поговорити?',
  answer_update_location: '📍 Хочеш оновити геолокацію перед надсиланням?',
  is_not_geo: 'Я очікую геолокацію 📍',
  update_location:
    '✅ Готово! Геолокація оновлена. Тепер знайдемо тобі когось поруч 😉',
  not_update: 'Гаразд, тоді переходимо далі',
  answer_for_send_gender:
    '👀 Кому саме хочеш надіслати повідомлення?\n\nОбери, будь ласка, один з варіантів:',
};
